
<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>PayloadContent</key>
    <array>
      <dict>
        <key>DNSSettings</key>
        <dict>
          <key>DNSProtocol</key>
          <string>HTTPS</string>
          <key>ServerAddresses</key>
          <array/>
          <key>ServerURL</key>
          <string>https://1.1.1.1/dns-query</string>
        </dict>
        <key>PayloadDescription</key>
        <string>Configures device to use Cloudflare Encrypted DNS over HTTPS</string>
        <key>PayloadDisplayName</key>
        <string>Cloudflare DNS over HTTPS</string>
        <key>PayloadIdentifier</key>
        <string>com.apple.dnsSettings.managed.8f4c029d-8405-445d-add5-9a324a11bff8</string>
        <key>PayloadType</key>
        <string>com.apple.dnsSettings.managed</string>
        <key>PayloadUUID</key>
        <string>eafb30f6-fad1-4937-a297-2589bdf03158</string>
        <key>PayloadVersion</key>
        <integer>1</integer>
        <key>ProhibitDisablement</key>
        <false/>
      </dict>
    </array>
    <key>PayloadDescription</key>
    <string>添加 Cloudflare DNS over HTTPS</string>
    <key>PayloadDisplayName</key>
    <string>Cloudflare DNS over HTTPS</string>
    <key>PayloadIdentifier</key>
    <string>com.notjakob.apple-dns.dee4c555-f7b3-4a1b-a881-a3c64da56f4c</string>
    <key>PayloadRemovalDisallowed</key>
    <false/>
    <key>PayloadType</key>
    <string>Configuration</string>
    <key>PayloadUUID</key>
    <string>201fe7b5-0027-4a3e-a5d6-8083aed888f8</string>
    <key>PayloadVersion</key>
    <integer>1</integer>
  </dict>
</plist>
