<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>PayloadContent</key>
	<array>
		<dict>
			<key>DNSSettings</key>
			<dict>
				<key>DNSProtocol</key>
				<string>TLS</string>
				<key>ServerAddresses</key>
				<array>
					<string>1.12.12.12</string>
					<string>120.53.53.53</string>
				</array>
				<key>ServerName</key>
				<string>dot.pub</string>
			</dict>
			<key>PayloadDescription</key>
			<string>Configures device to use DnsPod Encrypted DNS over TLS</string>
			<key>PayloadDisplayName</key>
			<string>DnsPod DNS over TLS</string>
			<key>PayloadIdentifier</key>
			<string>com.apple.dnsSettings.managed.58eab2d2-1163-4a82-a7db-8091d5eb4507</string>
			<key>PayloadType</key>
			<string>com.apple.dnsSettings.managed</string>
			<key>PayloadUUID</key>
			<string>58eab2d2-1163-4a82-a7db-8091d5eb4507</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>ProhibitDisablement</key>
			<false/>
		</dict>
	</array>
	<key>PayloadDescription</key>
	<string>Adds the DnsPod to iOS systems</string>
	<key>PayloadDisplayName</key>
	<string>DnsPod DNS over TLS</string>
	<key>PayloadIdentifier</key>
	<string>apple-dns.c93b1f4a-0522-4aed-8e31-30eea0c10344</string>
	<key>PayloadRemovalDisallowed</key>
	<false/>
	<key>PayloadType</key>
	<string>Configuration</string>
	<key>PayloadUUID</key>
	<string>c93b1f4a-0522-4aed-8e31-30eea0c10344</string>
	<key>PayloadVersion</key>
	<integer>1</integer>
</dict>
</plist>
